Revit 2027 API
HostedSweep.HorizontalOffset Property
Retrieve/set the horizontal offset of the hosted sweep object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double HorizontalOffset { get; set; }
Public Property HorizontalOffset As Double
	Get
	Set
public:
property double HorizontalOffset {
	double get ();
	void set (double value);
}
member HorizontalOffset : float with get, set
Property Value
Double
See Also
Reference
HostedSweep Class
Autodesk.Revit.DB Namespace